"""
 Створити декілька(мінімум 4) класів які пов'язані з собою наслідуванням
- всі класи(крім основного від якого наслідуються інші) повинні бути чиїмись "синами".
Деякі класи не повинні мати зв'язку батько-син

Приклад:
Тварини / Чотирилапі(Тварини) / Кошачі(Чотирилапі)
Псові(Чотирилапі) / Кішки(Кошачі) / Леви(Кошачі)

- кожен класс повинен бути в своєму файлі
- У кожного класу повинні бути не порожні НЕМАГІЧНІ методи.
Магічний починаеться і закінчуеться з __
- у кожного класе повинен бути __init__
- використання super обов'язково.
використати і підписати коментарями де воно є
- наслідування
- інкапсуляція
- поліморфізм
Зверніть увагу, що __init__, super повинні не просто бути,а виконувати якусь практичну роль
"""

